[
  {
    "id": "wfouyWv-5oM",
    "title": "Episode 1-1 Highlight | 3rd-Gen Chaebol Heiress Kim Ji-won X Yongduri Village Elite Kim Soo-hyun, The Truth Behind the Wedding of the Century!",
    "thumbnail": "https://i.ytimg.com/vi/wfouyWv-5oM/maxresdefault.jpg",
    "synopsis": "A billionaire heiress goes undercover as an intern. A coworker falls for her and proposes — but vanishes when he learns who she really is. She brings him back, and they have \"the wedding of the century.\" Three years later, divorce rumors begin..."
  },
  {
    "id": "DlASnEJzVUU",
    "title": "Episode 1-2 Highlights | Kim Soo-hyun's Never-Ending Tears from His Brutal Life in the Queens Family.",
    "thumbnail": "https://i.ytimg.com/vi/DlASnEJzVUU/maxresdefault.jpg",
    "synopsis": "Baek Hyun-woo, a commoner who married into the powerful Queens Group chaebol, endures constant control from his father-in-law—pressured to have a baby, sent abroad, and denied even naming rights for his own child. The sons-in-law bond over shared misery while preparing ancestral rites their wives conveniently avoid."
  },
  {
    "id": "mzSoALcmQKU",
    "title": "Episode 1-3 Highlights | Chaebol Son-in-law Kim Soo-hyun Finally Decides to Divorce—But Then a Huge Problem Arises?!",
    "thumbnail": "https://i.ytimg.com/vi/mzSoALcmQKU/maxresdefault.jpg",
    "synopsis": "Baek Hyun-woo, exhausted from years of mistreatment by his in-laws, finally decides to divorce his cold wife Hong Hye-in. But just as he announces his decision, she reveals she only has three months to live."
  },
  {
    "id": "BFIkG3fq83w",
    "thumbnail": "https://i.ytimg.com/vi/BFIkG3fq83w/maxresdefault.jpg",
    "title": "Episode 2-1 Highlights | Kim Soo-hyun Secretly Dreams of Escaping His In-Laws' House...!?",
    "synopsis": "Hong Hye-in receives a devastating diagnosis—a rare brain tumor with only three months to live. As Hyun-woo processes the news, his friend suggests he use this as an opportunity. But on their wedding anniversary, Hyun-woo shows up with flowers, choosing a different path."
  },
  {
    "id": "-fRzq48l-BI",
    "thumbnail": "https://i.ytimg.com/vi/-fRzq48l-BI/maxresdefault.jpg",
    "title": "Episode 2-2 Highlights | A Rival Appears Between Kim Soo-hyun & Kim Ji-won—Park Sung-hoon?!",
    "synopsis": "As Hyun-woo grows unexpectedly caring toward Hye-in, her college ex Yoon Eun-sung returns to Korea as a powerful business figure. When Eun-sung provocatively tells Hyun-woo about his past feelings for Hye-in, jealousy quietly stirs."
  },
  {
    "id": "FZLQ53TFzQo",
    "title": "Episode 2-3 Highlights | ※Meticulous Build-up※ A Completely Changed Kim Soo-hyun, Now Devoted to Wife Kim Ji-won♡",
    "synopsis": "Hyun-woo's transformation becomes undeniable—moving closer at the dining table, rushing to help during meetings. Hye-in confesses she suspected his motives at first, but seeing him research miracles and cures gives her strength to fight. She vows to survive, if only for his sake.",
    "thumbnail": "https://i.ytimg.com/vi/FZLQ53TFzQo/maxresdefault.jpg"
  },
  {
    "id": "uwG_0Zabm_4",
    "thumbnail": "https://i.ytimg.com/vi/uwG_0Zabm_4/maxresdefault.jpg",
    "title": "Episode 3-1 Highlights | Park Sung-hoon Interfering with Kim Soo-hyun & Kim Ji-won's Marriage—His Mysterious True Nature?!",
    "synopsis": "A hunting dog incident reveals Yoon Eun-sung's disturbing philosophy about 'valuable' vs 'abandoned' lives. Meanwhile, CCTV footage hints at a family betrayal. A flashback to 20 years ago shows a young boy who killed dogs—with an eerily familiar mindset. The episode ends with Hyun-woo discovering Hye-in and Eun-sung had drinks alone together."
  },
  {
    "id": "CYgerxPtnF8",
    "thumbnail": "https://i.ytimg.com/vi/CYgerxPtnF8/maxresdefault.jpg",
    "title": "Episode 3-2 Highlights | Malfunctioning Heart🚨 Kim Ji-won Starts to Fall for Husband Kim Soo-hyun♡.♡",
    "synopsis": "After a late night together, Hye-in asks Hyun-woo to help unbutton her dress—an unexpectedly intimate moment. As she processes her terminal diagnosis, she realizes her husband might be what she'd miss most. Later, she asks her secretary if it's normal for a married woman to feel her heart race looking at her husband. The answer? 'She must be sick.'"
  },
  {
    "id": "TUyx934079M",
    "thumbnail": "https://i.ytimg.com/vi/TUyx934079M/maxresdefault.jpg",
    "title": "Episode 3-3 Highlights | ★Romantic Mood ON★ Kim Ji-won's Heart Opens Again to Kim Soo-hyun",
    "synopsis": "Hye-in suggests they stay overnight together, reminiscing about when they used to sleep holding each other in a narrow bed. When Eun-sung tries to plant doubt about Hyun-woo's love, Hye-in delivers a powerful definition of love: 'Love isn't sharing happy moments—it's enduring the unbearable together.' The episode ends with Hye-in kissing Hyun-woo, declaring she'll start doing things she's never done before."
  },
  {
    "id": "t0UNVrpnFLQ",
    "thumbnail": "https://i.ytimg.com/vi/t0UNVrpnFLQ/maxresdefault.jpg",
    "title": "Episode 4-1 Highlights | Kim Soo-hyun Falls for His Wife Kim Ji-won All Over Again...♡",
    "synopsis": "Hyun-woo can't stop his heart from racing around Hye-in—whether she's wiping something off his face or trying on a rare Hermès vintage dress. He buys her half-price sneakers, justifying it as 'practical,' but his friend sees through him. When Secretary Kim mentions Hye-in spending time with Eun-sung, Hyun-woo insists he's not jealous... while burning the meat he forgot he was grilling."
  },
  {
    "id": "_OVGf5cbZRs",
    "title": "Episode 4-2 Highlights | ♨Tension Alert♨ Kim Soo-hyun × Kim Ji-won × Park Sung-hoon, Spicy Relationship Dynamics",
    "synopsis": "Hyun-woo's jealousy flares when Eun-sung comes to their home for a weekend meeting with Hye-in. He confronts her about letting Eun-sung touch her hair when she hates it from others. Meanwhile, Hye-in shows her fierce side handling an aggressive customer, and surprises everyone by visiting Hyun-woo's rural hometown to win over his father's friends.",
    "thumbnail": "https://i.ytimg.com/vi/_OVGf5cbZRs/maxresdefault.jpg"
  },
  {
    "id": "fhHjtkpFmZg",
    "thumbnail": "https://i.ytimg.com/vi/fhHjtkpFmZg/maxresdefault.jpg",
    "title": "Episode 4-3 Highlights | \"I Was Worried\" Kim Soo-hyun's Growing Concern for His Sick Wife Kim Ji-won",
    "synopsis": "Hye-in's mother-in-law attacks her with vicious accusations, calling her 'rotten to the bone.' Hyun-woo steps in to protect her. Later, he urges her to tell her family about her illness, but Hye-in reveals her heartbreaking reason: her parents already lost one child. When Hye-in visits his hometown and goes missing, Hyun-woo panics—only to find her confused and scared, unable to remember how she got there. Her terrifying confession about memory loss marks a turning point in their relationship."
  },
  {
    "id": "XU7nDk8aORk",
    "thumbnail": "https://i.ytimg.com/vi/XU7nDk8aORk/maxresdefault.jpg",
    "title": "Episode 5-1 Highlights | Kim Soo-hyun's Fluttering Heart, Trembling, and Love for Wife Kim Ji-won",
    "synopsis": "Hyun-woo helps Hye-in dry her hair with an old hair dryer that needs a special touch. When she worries about her short 'life line,' he dismisses superstition but can't hide his concern. As she asks him to accompany her to Europe for treatment, Hyun-woo fights his growing feelings—'I can't go back in there. If I do, I won't be able to leave.' A flashback reveals Hye-in's simple dream: to travel with her husband someday."
  },
  {
    "id": "jBD-d7i9rxU",
    "thumbnail": "https://i.ytimg.com/vi/jBD-d7i9rxU/maxresdefault.jpg",
    "title": "Episode 5-2 Highlights | Kim Soo-hyun × Kim Ji-won, The Couple Who Inevitably Drifted Apart",
    "synopsis": "A flashback reveals how Hyun-woo and Hye-in's marriage fell apart. He tells his friend he can't go inside—being near her makes him lose his mind, but not in a good way anymore. Hye-in clears out the baby items, a painful reminder of the child they'll never have. She moves to a separate room. When she waits outside all night for him to come home, she denies it fiercely—'I'm not the type to wait for anyone.' His response cuts deep: 'I know better than anyone you're not that kind of person.'"
  },
  {
    "id": "5OWJHujR2xk",
    "thumbnail": "https://i.ytimg.com/vi/5OWJHujR2xk/maxresdefault.jpg",
    "title": "Episode 5-3 Highlights | Kim Soo-hyun × Kim Ji-won, Confirming Their Unchanged True Love!",
    "synopsis": "A flashback shows Hyun-woo's sister trying to break them up, but he declares: 'The person I love now is Hong Hye-in alone.' In the present, when Hye-in is rejected for treatment and disappears, Hyun-woo finds her at the place she loved during their honeymoon. She finally breaks down: 'I cried so much after marrying you.' His response is a tearful apology: 'I should have been by your side.' She admits she just wanted to go home—with him."
  },
  {
    "id": "6phaTMoewCk",
    "thumbnail": "https://i.ytimg.com/vi/6phaTMoewCk/maxresdefault.jpg",
    "title": "Episode 6-1 Highlights | Park Sung-hoon × Lee Joo-bin's Fierce Ambition Targeting the Queens Family 🔥",
    "synopsis": "A childhood flashback reveals Hong Ga-in's calculated ambition—she targeted the Hong family's son from the moment they met. In the present, a bugging device is found in Grandfather's study, and the receiver is discovered in Hyun-woo's room, framing him. As family accusations fly, Hye-in desperately begs: 'Say it isn't true. Say you don't know.' The episode exposes the dark schemes threatening the Queens empire from within."
  }
]
